In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)

#### 1. How many distinct (different) actors' last names are there?

In [18]:
query = '''SELECT COUNT(DISTINCT last_name) AS actors_with_diff_ln
from sakila.actor'''
data = pd.read_sql_query(query, engine)
data.head()

   actors_with_diff_ln
0                  121

In [20]:
query1= '''SELECT DISTINCT last_name
from sakila.actor'''
data1 = pd.read_sql_query(query1, engine)
data1.head()

  last_name
0    AKROYD
1     ALLEN
2   ASTAIRE
3    BACALL
4    BAILEY

#### 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [22]:
query2= '''SELECT *,
CASE
WHEN weekday(rental_date) < 6 then 'Workday'
ELSE 'Weekend'
END AS 'day_type'
FROM sakila.rental'''
data2 = pd.read_sql_query(query2, engine)
data2.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Workday

#### 3. Get all films with ARMAGEDDON in the title.

In [29]:
## ?? tf is going on here... check STO
query3= """SELECT * FROM sakila.film
WHERE title LIKE '%armageddon%' """
data3 = pd.read_sql_query(query3, engine)
data3.head()

TypeError: not enough arguments for format string

#### 4. Get 10 the longest films.

In [30]:
query4= """SELECT * FROM sakila.film
ORDER BY length desc 
LIMIT 10"""
data4 = pd.read_sql_query(query4, engine)
data4.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,349,GANGS PRIDE,A Taut Character Study of a Woman And a A Shar...,2006,1,None,4,2.99,185,27.99,PG-13,Behind the Scenes,2006-02-15 05:03:42
1,872,SWEET BROTHERHOOD,A Unbelieveable Epistle of a Sumo Wrestler And...,2006,1,None,3,2.99,185,27.99,R,Deleted Scenes,2006-02-15 05:03:42
2,609,MUSCLE BRIGHT,A Stunning Panorama of a Sumo Wrestler And a H...,2006,1,None,7,2.99,185,23.99,G,Deleted Scenes,2006-02-15 05:03:42
3,817,SOLDIERS EVOLUTION,A Lacklusture Panorama of a A Shark And a Pion...,2006,1,None,7,4.99,185,27.99,R,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42
4,690,POND SEATTLE,A Stunning Drama of a Teacher And a Boat who m...,2006,1,None,7,2.99,185,25.99,PG-13,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

#### 5. How many films include Behind the Scenes content?

In [ ]:
# Same bs ask miguel !!
query5= """SELECT COUNT(special_features) FROM sakila.film
WHERE special_features LIKE '%Behind the Scenes%'"""
data5 = pd.read_sql_query(query5, engine)
data5.head()

#### 6. Which kind of movies (rating) have a mean duration of more than two hours?

In [34]:
query6= """SELECT rating, COUNT(rating), ROUND((AVG(length)/60),2) AS duration_mean
FROM sakila.film
GROUP BY rating
HAVING duration_mean > 2"""
data6 = pd.read_sql_query(query6, engine)
data6.head()

  rating  COUNT(rating)  duration_mean
0  PG-13            223           2.01

#### 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [36]:
query7= """SELECT title, length 
FROM sakila.film
WHERE (length IS NOT NULL) AND (length != 0)
ORDER BY length;"""
data7 = pd.read_sql_query(query7, engine)
data7.head()

                 title  length
0         ALIEN CENTER      46
1            IRON MOON      46
2        KWAI HOMEWARD      46
3     LABYRINTH LEAGUE      46
4  RIDGEMONT SUBMARINE      46